# Ejercicios Pandas Deep

![imagen](img/ejercicios.png)

## Ejercicio 1
Importa el módulo `pandas` y el módulo `numpy`.

In [1]:
import numpy as np
import pandas as pd

## Ejercicio 2 

Importa el dataset desde ésta [dirección](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

## Ejercicio 3

¿Qué continente bebe más cerveza de media?

In [6]:
df[["beer_servings","continent"]].groupby("continent").agg("mean")

#EU es el continente que más cerveza bebe de media

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
OC             89.687500
SA            175.083333

## Ejercicio 4 

Describe el consumo de vino por continente

In [7]:
df[["wine_servings","continent"]].groupby("continent").describe()

# EU es el continente que más porciones de vino consume

          wine_servings                                                   \
                  count        mean        std  min   25%    50%     75%
continent
AF                 53.0   16.264151  38.846419  0.0   1.0    2.0   13.00
AS                 44.0    9.068182  21.667034  0.0   0.0    1.0    8.00
EU                 45.0  142.222222  97.421738  0.0  59.0  128.0  195.00
OC                 16.0   35.625000  64.555790  0.0   1.0    8.5   23.25
SA                 12.0   62.416667  88.620189  1.0   3.0   12.0   98.50


             max
continent
AF         233.0
AS         123.0
EU         370.0
OC         212.0
SA         221.0

## Ejercicio 5

¿Cuál es el consumo medio de alcohol por continente?

In [14]:
df[["total_litres_of_pure_alcohol","continent"]].groupby("continent").agg("mean")

# Europa tiene el mayor consumo medio de alcohol con 8.6 litros de media

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
OC                             3.381250
SA                             6.308333

## Ejercicio 6

¿Y cuál es la mediana de consumo?

In [4]:
df[["total_litres_of_pure_alcohol"]].median()

total_litres_of_pure_alcohol    4.2
dtype: float64

## Ejercicio 7

Por continente, calcula media, máximo y mínimo de consumo de bebidas espirituosas

In [21]:
df[["spirit_servings","continent"]].groupby("continent").agg("median")

           spirit_servings
continent
AF                     3.0
AS                    16.0
EU                   122.0
OC                    37.0
SA                   108.5

In [8]:
df.groupby("continent").spirit_servings.max()

continent
AF    152
AS    326
EU    373
OC    254
SA    302
Name: spirit_servings, dtype: int64

In [26]:
df.groupby("continent").spirit_servings.agg("min")

continent
AF     0
AS     0
EU     0
OC     0
SA    25
Name: spirit_servings, dtype: int64

## Ejercicio 8

Crea una función lambda para poner en minúscula la columna `continent`

In [9]:
def go_lower(x):
    return x.lower()

In [10]:
go_lower("AS")

'as'

In [11]:
go_lower = lambda x: x.lower()

In [12]:
go_lower("AS")

'as'

In [13]:
df=df.dropna()

In [14]:
df.continent.apply(lambda x: x.lower())

0      as
1      eu
2      af
3      eu
4      af
       ..
188    sa
189    as
190    as
191    af
192    af
Name: continent, Length: 170, dtype: object

## Ejercicio 9

Crea una nueva columna llamada `more_wine_than_beer` con booleanos. True si wine_servings es mayor que beer_servings

In [81]:
lis_bool = df.wine_servings > df.beer_servings

df["more_wine_than_beer"] = lis_bool.tolist()

df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,more_wine_than_beer
0,Afghanistan,0,0,0,0.0,AS,False
1,Albania,89,132,54,4.9,EU,False
2,Algeria,25,0,14,0.7,AF,False
3,Andorra,245,138,312,12.4,EU,True
4,Angola,217,57,45,5.9,AF,False

## Ejercicio 10

Multiplica todo el dataframe por 10

In [63]:
df._get_numeric_data()*10

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,0,0,0.0
1,890,1320,540,49.0
2,250,0,140,7.0
3,2450,1380,3120,124.0
4,2170,570,450,59.0
...,...,...,...,...
188,3330,1000,30,77.0
189,1110,20,10,20.0
190,60,0,0,1.0
191,320,190,40,25.0
192,640,180,40,47.0

## Ejercicio 11

Ahora carga los datasets [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) y [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv)

In [19]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")

cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [20]:
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

## Ejercicio 12

Elimina las columnas nulas de `cars1`

In [22]:
cars1.dropna(axis=1, how = "all").head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

## Ejercicio 13

¿Cuales son las dimensiones de los dos dataframes?

In [89]:
cars1.shape

(198, 14)

In [90]:
cars2.shape

(200, 9)

## Ejercicio 14

Une los dos dataframes en uno solo llamado `cars`

In [24]:
cars = pd.concat([cars1.dropna(1),cars2], axis=0)

cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

In [99]:
cars.shape

(398, 9)